{
    "personal": {
        "name": "beka",
        "lasname": "chaduneli",
        "age": 19,
        "address": "Tbilisi, Georgia",
        "phone": "(+995) 571 11 85 60",
        "bithday": "20 November",
        "bithdate": "2003.11.20",
        "noprogrammingstack": {
            "photoshop": "Adobe Photoshop",
            "videomontage": {
                "sonyvegas": "Sony Vegas",
                "filmora": "Filmora"
            }
        },
        "work": {
            "name": "Artmedia",
            "nameLink": "https://www.linkedin.com/company/artmedia-web/mycompany/",
            "contents": [
                {
                    "name": "Frontend Internship",
                    "data": "20.04.2023 - present",
                    "text": "I started working as a Frontend developer intern at Artmedia on April 20, and since that day I have been getting real experience with Next.js, Javascript, Scss, Gsap, Jquery, Trello, and Jira."
                }
            ]
        },
        "languages": {
            "contents": [
                {
                    "name": "English",
                    "data": "CONVERSANT",
                    "text": "I speak English at the B1 level. I have no problem listening to or understanding anything. I have a slight barrier when speaking because I make grammatical mistakes"
                },
                {
                    "name": "Georgian",
                    "data": "NATIVE",
                    "text": "Georgian is my native language"
                }
            ]
        },
        "educations": [
            {
                "name": "BTU",
                "nameLink": "https://btu.edu.ge/",
                "contents": [
                    {
                        "name": "Business Administration - Management",
                        "data": "18.09.2021 - 01.07.2022",
                        "text": "In 2021, I entered the Faculty of Management at the University of Business and Technology, where I took such interesting subjects as principles of Digital technologies, Startup, Mathematics, Introduction to entrepreneurship, Job search, and Academic writing"
                    },
                    {
                        "name": "Information Technology",
                        "data": "18.09.2022 - present",
                        "text": "After 1 year of teaching management, I decided that my sphere was programming, after which I moved to the faculty of Information technology, where I am still studying today, and during this time I took such necessary and interesting subjects as Python, Calculus, Web development, database administration, information security, and English"
                    }
                ]
            },
            {
                "name": "Bitcamp",
                "nameLink": "https://www.bitcamp.ge/programs",
                "contents": [
                    {
                        "name": "Full Stack Development, Bitcamp Pro",
                        "data": "20.12.2022 - 20.03.2023",
                        "text": "At the end of 2022, a great desire to develop more intensively appeared, which led to the fact that I started studying in the Full stack development boot camp, where I covered the fundamental knowledge of web development. I spent an average of 8-10 hours a day in programming and tried to get a lot of experience in practice. You can see these projects on the projects page. In Bitcamp Pro, I mastered such skills as Problem Solving, JavaScript, React.js, Node.js, Algorithms, Data Structures, GitHub · MySql, Postgres, Figma, Express, CSS, HTML, and Postman"
                    },
                    {
                        "name": "React 101",
                        "data": "20.03.2023 - 16.04.2023",
                        "text": "When I covered the fundamentals well, I decided to learn the Javascript framework. Because Bitcamp also had a course on React, I decided to take that course. During the course, I made more than 10 projects, and along with React, I mastered such skills as Styled-components, Typescript, Framer motion, and Next"
                    }
                ]
            }
        ],

        "position": "Full-Stack Developer",

        "linkedin": "https://www.linkedin.com/in/beka-chaduneli-28203422b/",
        "github": "https://github.com/bekaChaduneli",
        "facebook": "https://www.facebook.com/chadunelibb/",
        "instagram": "https://www.instagram.com/bekachaduneli/",
        "mail": "beka.chaduneli.1@btu.edu.ge"
    },
    "projects": [
        {
            "name": "Breadit",
            "slug": "social network",
            "id": "breadit",
            "videoLink": "breadit",
            "best": true,
            "display": true,
            "frameworks": ["next", "typescript", "prisma", "tailwind", "mysql"],
            "date": " Jun",
            "image": ["reddit-clone-main.png", "/reddit-clone-post.png"],
            "tools": [
                "/next.png",
                "/typescript.png",
                "/prisma.png",
                "/tailwind.png",
                "/mysql.png"
            ],
            "github": "https://github.com/bekaChaduneli/reddit-clone",
            "live": "https://reddit-clone-ir9l.vercel.app/",
            "about": [
                "Breadit is created with Next.js, NextAuth, TypeScript, Prisma, and MySQL, Breadit offers a seamless and intuitive experience for users seeking to connect and engage with diverse communities",
                "With Breadit, users can register via email. The platform allows for the creation and joining of communities, enabling users to connect with peoples",
                "Breadit's posting system empowers users to share a wide range of content types, while the interactive features, such as reactions, comments, and replies.",
                "The main page's dynamic feed presents users with a wealth of posts, ensuring a constant stream of content tailored to their preferences and keeping them engaged",
                "Breadit has succeeded in delivering a reliable and user-centric platform, offering an enjoyable experience for online community to connect, share, and engage in meaningful discussions"
            ]
        },
        {
            "name": "Spotify Clone",
            "slug": "Music upload platform",
            "id": "spotify-clone",
            "videoLink": "spotify-clone",
            "best": true,
            "display": false,
            "frameworks": ["next", "supabase", "tailwind", "typescript"],
            "date": " Jun",
            "image": [
                "spotify-clone-main.png",
                "spotify-clone-liked.png",
                "spotify-clone-search.png"
            ],
            "tools": [
                "/next.png",
                "/tailwind.png",
                "/supabase.png",
                "/typescript.png"
            ],
            "github": "https://github.com/bekaChaduneli/spotify-clone",
            "live": "https://spotify-clone-tau-ochre.vercel.app/",
            "about": [
                "Introducing a music platform, inspired by the popular music streaming platform. This project, as discussed earlier, is built with Next.js, TypeScript, Supabase, and Tailwind CSS, offering users a music experience",
                "The Spotify clone allows users to register, upload their music, search for songs, create playlists, and enjoy a seamless listening experience.",
                "With Next.js, the project leverages server-side rendering for efficient performance, while TypeScript ensures strong typing and code integrity. Supabase provides a reliable database solution for user authentication, music storage, and playlist management. Tailwind CSS ensures a sleek and responsive design across different devices",
                "Experience the joy of music with our Spotify clone, where you can explore, create, and enjoy your favorite tunes."
            ]
        },
        {
            "name": "Weddings project",
            "slug": "weddings specified platform",
            "id": "weddings-project",
            "videoLink": "wedding-project",
            "best": true,
            "display": false,
            "frameworks": ["html", "scss", "jquery", "gsap"],
            "date": " Apr",
            "image": [
                "weddings-main.png",
                "weddings-about.png",
                "weddings-package.png",
                "weddings-packages.png",
                "weddings-honeymoon.png"
            ],
            "tools": ["/html.png", "/scss.png", "/gsap.png", "/jquery.png"],
            "live": "http://wedding.artmedia.ge/",
            "about": [
                "Introducing a captivating wedding site that offers a seamless booking experience for couples. This project, which I previously shared with you, provides a platform where users can effortlessly plan and book their dream weddings",
                "Tthe site allows couples to explore various wedding options, browse through available services, and make bookings based on their preferences. The intuitive design ensures easy navigation and showcases the elegance and sophistication synonymous with weddings",
                "Created with HTML, GSAP, SCSS, and jQuery, this project reflects my dedication to delivering visually appealing and functional web applications."
            ]
        },

        {
            "name": "Google Clone",
            "slug": "Site with google search system,created with google api",
            "id": "google-clone",
            "videoLink": "google-clone",
            "best": true,
            "display": false,
            "frameworks": ["next", "tailwind"],
            "date": " Apr",
            "image": [
                "google-main.png",
                "google-search.png",
                "google-images.png"
            ],
            "tools": ["/next.png", "/tailwind.png"],
            "github": "https://github.com/bekaChaduneli/google-clone",
            "live": "https://google-clone-coral-nine.vercel.app/",
            "about": [
                "Introducing a Google clone, which is craeted with Next.js and Tailwind CSS. This project, powered by the Google API, offers users a familiar search experience where they can explore a vast array of information, view images, and even search random words",
                "It looks like real Google. Clone provides an intuitive interface for users to search for anything they desire. The project dynamically displays the number of results found for each search term, mimicking the functionality of the original search engine",
                "Built on Next.js, the project delivers efficient server-side rendering and ensures a seamless browsing experience. Tailwind CSS enhances the design aesthetics, creating a visually appealing and responsive user interface"
            ]
        },
        {
            "name": "My Portfolio",
            "slug": "Developer portfolio website",
            "id": "my-portfolio",
            "best": false,
            "display": false,
            "frameworks": ["next", "scss", "gsap", "framermotion"],
            "date": " Mar",
            "videoLink": "my-new-portfolio",
            "image": [
                "my-portfolio-main.png",
                "my-portfolio-about.png",
                "my-portfolio-projects.png",
                "my-portfolio-contact.png"
            ],
            "tools": [
                "/next.png",
                "/scss.png",
                "/gsap.png",
                "/framermotion.png"
            ],
            "github": "https://github.com/bekaChaduneli/my-new-portfolio",
            "live": "https://portfolio-six-ecru-43.vercel.app/",
            "about": [
                "my portfolio project, a platform I've created using Next.js, SCSS, GSAP, and Framer Motion",
                "The main goal was to get experience on a project that would be completely my plan without all the templates and present information about myself"
            ]
        },
        {
            "name": "IMBd Clone",
            "slug": "List where information about famous and unknown movies is stored",
            "id": "imdb-clone",
            "videoLink": "imdb-clone",
            "best": true,
            "display": false,
            "frameworks": ["next", "tailwind"],
            "date": " Apr",
            "image": ["imdb-main.png", "imdb-about.png", "imdb-movie.png"],
            "tools": ["/next.png", "/tailwind.png"],
            "github": "https://github.com/bekaChaduneli/imdb-clone",
            "live": "https://imdb-clone-self.vercel.app/",
            "about": [
                "This is my first Next.js project, allowing users to explore a vast collection of films available on IMDb. Discover film information, browse popular releases, and stay up-to-date with the latest trends in the film industry",
                "Using the IMDb API, this web application delivers real-time film data, ensuring accurate and comprehensive details for an enhanced user experience. The intuitive interface enables effortless searching and seamless navigation through film listings",
                "Built with Next.js, the project provides efficient server-side rendering and a smooth browsing experience. Tailwind CSS ensures a visually appealing and responsive design across different devices and screen sizes",
                "Unlock the magic of cinema with our Next.js and Tailwind CSS project, as we bring the IMDb library to your fingertips. Immerse yourself in the world of films, explore captivating stories, and stay connected with the latest releases"
            ]
        },
        {
            "name": "Entertaiment app",
            "slug": "Movies and series site",
            "id": "entertaiment-app",
            "videoLink": "entertaiment-app",
            "best": true,
            "display": false,
            "frameworks": ["react", "typescript", "styledcomponents"],
            "date": " Mar",
            "image": [
                "entertaiment-main.png",
                "entertaiment-movies.png",
                "entertaiment-series.png",
                "entertaiment-bookmarks.png"
            ],
            "tools": ["/react.png", "/typescript.png", "/styledcomponents.png"],
            "github": "https://github.com/bekaChaduneli/entertaiment-web-app",
            "live": "https://entertaiment-web-app-nu.vercel.app/",
            "about": [
                "Introducing an engaging films and series site built with React, Typescript, and styled components. This project offers a seamless browsing experience with four distinct pages: Main, Series, Movies, and Bookmarked Series and Films",
                "The Main page showcases the most popular films and series, providing users with an enticing selection of content. Users can explore the Series and Movies pages to discover a wide range of options in each category",
                "One unique feature of this project is the ability for users to bookmark their favorite films and series. The Bookmarked Series and Films page allows users to easily access and revisit their chosen content, ensuring a personalized and convenient viewing experience",
                "Created with React, Typescript, and styled components, this project emphasizes clean code structure and efficient performance. The integration of styled components enables a modular and visually appealing design, enhancing the overall user interface",
                "Embark on a journey of cinematic wonders with our films and series site. Explore popular titles, dive into captivating series, and bookmark your favorites for easy access. Immerse yourself in a world of entertainment as we present a user-centric platform designed to elevate your viewing experience"
            ]
        },
        {
            "name": "Planet facts",
            "best": true,
            "display": false,
            "slug": "Lots of information about planets in solar systems",
            "id": "planet-facts",
            "videoLink": "planet-facts",
            "frameworks": ["react", "typescript", "styledcomponents"],
            "date": " Mar",
            "image": [
                "planet-overview.png",
                "planet-structure.png",
                "planet-surface.png"
            ],
            "tools": ["/react.png", "/typescript.png", "/styledcomponents.png"],
            "github": "https://github.com/bekaChaduneli/planet-facts-react",
            "live": "https://planet-facts-reacts.vercel.app/",
            "about": [
                "Introducing an enlightening planets facts page created with React, Typescript, and styled components. This project offers users a captivating journey through the vast expanse of our solar system. Leveraging the power of React Router, users can effortlessly explore detailed information about various celestial bodies, including Earth, Mars, Jupiter, and more",
                "Immerse yourself in the awe-inspiring wonders of each planet as you Immerse yourself in the awe-inspiring wonders of each planet as you delve into their unique characteristics, such as size, composition, atmosphere, and notable features. This user-friendly interface ensures seamless navigation and an engaging educational experience",
                "Developed with React, Typescript, and styled components, this project prioritizes code modularity and performance optimization. The use of styled components enhances the visual aesthetics, creating a cohesive and visually appealing design",
                "Embark on a cosmic journey through our planets facts page, where you can expand your knowledge of the solar system. Explore fascinating facts, unravel celestial mysteries, and ignite your curiosity about the planets that surround us. Join us as we unveil the secrets of our galactic neighborhood in this captivating React-based project"
            ]
        },
        {
            "name": "3D Portfolio",
            "best": false,
            "slug": "A 3D website with a flexible portfolio-like design powered by three js",
            "frameworks": ["three", "react", "typescript", "styledcomponents"],
            "id": "3d-portfolio",
            "react": true,
            "typescript": true,
            "javascript": false,
            "three": true,
            "styledcomponents": true,
            "chakraui": false,
            "markup": false,
            "tailwind": false,
            "display": false,
            "date": " Mar",
            "image": ["3d-portfolio.png"],
            "tools": [
                "/three.png",
                "/react.png",
                "/typescript.png",
                "/styledcomponents.png"
            ],
            "github": "https://github.com/bekaChaduneli/3d-portfolio",
            "live": "https://3d-portfolio-liard.vercel.app/",
            "about": [
                "Introducing an immersive website crafted with React, Typescript, and styled components. This project showcases a visually stunning and seamless user experience, incorporating the power of Three.js for captivating transitions and animations",
                "With its modern and sleek design, the website takes visitors on a captivating journey, engaging them with smooth transitions between pages and delightful visual effects. The integration of React and Typescript ensures a robust and maintainable codebase, while styled components enhance the visual aesthetics and provide a consistent design language",
                "Experience a seamless and visually pleasing exploration as you navigate through the website's pages. Immerse yourself in the captivating transitions powered by Three.js, and discover the seamless synergy between technology and design. Join us on this immersive journey as we invite you to experience the magic of this React-based project, designed to captivate and engage visitors with its fluid and visually appealing user interface"
            ]
        },
        {
            "name": "Clock app",
            "best": false,
            "slug": "Locator of user's location and time information",
            "id": "clock-app",
            "videoLink": "clock-app",
            "display": false,
            "date": " Mar",
            "frameworks": ["react", "typescript", "chakraui"],
            "image": ["clock-closed.png", "clock-opened.png"],
            "tools": ["/react.png", "/typescript.png", "/chakraui.png"],
            "github": "https://github.com/bekaChaduneli/clock-app-react",
            "live": "https://clock-app-react-z4tq.vercel.app/",
            "about": [
                "Introducing a clock website built with React, Typescript, and Chakra UI. This project allows users to check the time in their respective time zone and provides information about their location",
                "Additionally, users are presented with randomly generated phrases that refresh on each visit, sourced from various APIs. The website offers a simple and intuitive interface, prioritizing functionality and ease of use",
                "Users can effortlessly view the current time in their nation and explore interesting phrases generated dynamically. Join us on this digital journey as we present a clock website that combines essential timekeeping features with intriguing random phrases, all powered by React, Typescript, and Chakra UI"
            ]
        },
        {
            "name": "Github user search",
            "best": false,
            "slug": "locator of github users information with github api",
            "id": "github-user-search-react",
            "videoLink": "github-search-app",
            "display": false,
            "frameworks": ["react", "styledcomponents"],
            "date": " Mar",

            "image": ["github-search-app.png"],
            "tools": ["/react.png", "/styledcomponents.png"],
            "github": "https://github.com/bekaChaduneli/github-user-search-app-REACT",
            "live": "https://github-user-search-app-react.vercel.app/",
            "about": [
                "Introducing a GitHub user search application built with React and styled components. This project enables users to search for GitHub users and access their information. It utilizes the GitHub API to fetch data and display relevant details about each user",
                "Initially created with HTML, CSS, and JavaScript, this project has been reimagined using React for enhanced functionality and improved user experience",
                "The application offers a seamless interface for users to search and explore GitHub profiles effortlessly. Join us as we dive into the world of GitHub users, leveraging the power of React and styled components to deliver a dynamic and intuitive search experience",
                "Discover the coding prowess of developers on GitHub and gain insights into their projects and contributions"
            ]
        },
        {
            "name": "Ecommerce product",
            "best": false,
            "slug": "Product purchase page where you can see many things about the product",
            "id": "ecommerce-product",
            "videoLink": "ecommerce-product-page",
            "display": false,
            "frameworks": ["javascript", "css", "html"],
            "date": " Feb",
            "image": [
                "ecommerce-main.png",
                "ecommerce-product.png",
                "ecommerce-cart.png"
            ],
            "tools": ["/javascript.png", "/css.png", "/html.png"],
            "github": "https://github.com/bekaChaduneli/ecommerce-product-page",
            "live": "https://bekachaduneli.github.io/ecommerce-product-page/",
            "about": [
                "Introducing an ecommerce product page created with HTML, CSS, and JavaScript. This project provides users with a platform to explore product listings, add items to their basket, view product images, and check the final price",
                "The website offers a clean and intuitive interface, allowing users to browse through various products and make informed purchase decisions. Leveraging the power of HTML, CSS, and JavaScript, this project delivers a seamless shopping experience, enabling users to interact with product details and add items to their virtual basket",
                "Join us on this digital journey as we present an ecommerce product page that showcases products, facilitates smooth navigation, and ensures a hassle-free shopping experience for users"
            ]
        },
        {
            "name": "My old Portfolio",
            "best": false,
            "slug": "Portfolio Website",
            "id": "portfolio",
            "videoLink": "my-portfolio",
            "display": false,
            "frameworks": ["react", "typescript", "three", "chakraui"],
            "date": " Feb",
            "image": [
                "portfolio-main.png",
                "portfolio-projects.png",
                "portfolio-skills.png"
            ],
            "tools": ["/javascript.png", "/css.png", "/html.png"],
            "github": "https://github.com/bekaChaduneli/my-portfolio",
            "live": "https://my-portfolio-pink-pi.vercel.app/",
            "about": [
                "my portfolio project, a platform I've created using React, TypeScript, Three.js, and Chakra UI.",
                "The main goal was to get experience on a project that would be completely my plan without all the templates and also to get a better experience with Framer motion and ThreeJS"
            ]
        },
        {
            "name": "Metaversus app",
            "best": false,
            "slug": "a Metaversus page with good animations and design",
            "id": "metaversus-app",
            "display": false,
            "date": " Mar",
            "frameworks": ["react", "tailwind", "framermotion"],
            "image": ["metaversus.png"],
            "tools": ["/react.png", "/tailwind.png", "/framermotion.png"],
            "github": "https://github.com/bekaChaduneli/metaversus-app",
            "about": [
                "Introducing a metaverse app created with React and Tailwind CSS. This project focuses on providing an immersive experience by incorporating smooth transitions using Framer Motion",
                "The main objective was to gain experience working with Framer Motion and create seamless animations throughout the app. With React's powerful framework and Tailwind CSS's utility classes, the app delivers a responsive and visually appealing interface",
                "Dive into the metaverse and explore a world of smooth transitions and captivating animations. This project showcases the seamless integration of React and Tailwind CSS while emphasizing the importance of creating engaging and interactive user experiences",
                "Join us on this digital adventure as we bring the metaverse to life, leveraging the power of React and Tailwind CSS to deliver a visually stunning and immersive app"
            ]
        },
        {
            "name": "Artmedia test",
            "best": false,
            "slug": "React minified project with validation, swipper and animations",
            "id": "company-project",
            "videoLink": "artmedia-test",
            "display": false,
            "date": " Apr",
            "frameworks": ["react", "tailwind"],
            "image": ["artmedia-test.png"],
            "tools": ["/react.png", "/tailwind.png"],
            "github": "https://github.com/bekaChaduneli/artmedia-project",
            "live": "https://artmedia-project-phi.vercel.app/",
            "about": [
                "Introducing my work test project created with React and Tailwind CSS. This project showcases the implementation of various features and functionalities, including the Splide slider, useForm validations, transitions, and more",
                "The project aims to demonstrate my proficiency in utilizing these technologies and integrating them seamlessly into a web application. With React's component-based architecture and Tailwind CSS's utility classes, the project offers a responsive and visually appealing user interface",
                "Explore the functionalities of the Splide slider, experience smooth transitions, and witness the power of useForm validations. This work test project serves as a testament to my skills and capabilities in creating dynamic and interactive web applications",
                "Join me on this journey as we delve into the world of React and Tailwind CSS, uncovering the potential of these technologies in delivering engaging user experiences"
            ]
        },
        {
            "name": "Interactive card details",
            "best": false,
            "slug": "Card filler site with useForm validations",
            "id": "interactive-card-details",
            "display": false,
            "frameworks": ["react", "typescript", "chakraui"],
            "date": " Mar",
            "image": ["interactive-card-details.png"],
            "tools": ["/react.png", "/typescript.png", "/chakraui.png"],
            "github": "https://github.com/bekaChaduneli/interactive-card-details-REACT",
            "about": [
                "Introducing a card project created with React, TypeScript, and Chakra UI. This project enables users to enter their information, including card numbers and other details, and dynamically generates a new card based on their inputs",
                "The project leverages the useForm library for validations, ensuring that the entered information meets the required criteria. With the power of React and TypeScript, the project offers a seamless and intuitive user interface for inputting and generating personalized cards",
                "Explore the functionality of the project as it dynamically generates cards based on user input, providing a practical and interactive experience",
                "Join us on this digital journey as we showcase the capabilities of React, TypeScript, and Chakra UI in creating a dynamic card project with form validations at its core"
            ]
        },
        {
            "name": "Interactive comment section",
            "best": false,
            "slug": "An interactive site for adding comments",
            "id": "interactive-comment-section",
            "videoLink": "comments-section",
            "display": false,
            "date": " Feb",
            "react": false,
            "frameworks": ["html", "css", "javascript"],
            "image": ["comments-section.png"],
            "tools": ["/javascript.png", "/css.png", "/html.png"],
            "github": "https://github.com/bekaChaduneli/interactive-comment-section",
            "live": "https://bekachaduneli.github.io/interactive-comment-section/",
            "about": [
                "Introducing a comment section project created with HTML, CSS, and JavaScript. This project allows users to engage in discussions by adding comments, replying to existing comments, deleting their comments, and editing their comments",
                "Additionally, users have the ability to express their reactions to comments. The project offers a user-friendly interface, providing a seamless experience for interacting with the comment section",
                "With the power of HTML, CSS, and JavaScript, users can actively participate in conversations, express their thoughts, and engage with other users",
                "Join us as we explore the functionalities of the comment section project, enabling users to communicate, collaborate, and share their opinions through an intuitive and interactive interface"
            ]
        },
        {
            "name": "Todo UI",
            "best": false,
            "slug": "An app to add and manage todos and see information about your local time",
            "id": "todo-ui",
            "videoLink": "todo-react",
            "date": " Mar",
            "image": ["todo-ui.png"],
            "frameworks": ["react", "tailwind"],
            "tools": ["/react.png", "/tailwind.png"],
            "github": "https://github.com/bekaChaduneli/Todo-UI-REACT",
            "live": "https://todo-ui-1b33c.web.app/",
            "about": [
                "Introducing a todo app created with React and Tailwind CSS. This project allows users to add and manage their todos, providing a convenient way to keep track of tasks. Users can add their todos, check them off upon completion, and easily delete them when no longer needed",
                "The app also displays the current time and day, providing users with additional context for their todos. With the simplicity of React and the flexibility of Tailwind CSS, the todo app offers a clean and user-friendly interface",
                "Stay organized and stay on top of your tasks with this intuitive todo app. Join us as we explore the functionalities of the app, helping users effectively manage their todos and stay productive throughout the day"
            ]
        },
        {
            "name": "Github user search",
            "best": false,
            "slug": "A site for finding information about github users",
            "id": "github-user-search",
            "videoLink": "github-search-app",
            "date": " Feb",
            "frameworks": ["html", "css", "javascript"],
            "image": ["github-search-app.png"],
            "tools": ["/javascript.png", "/css.png", "/html.png"],
            "github": "https://github.com/bekaChaduneli/github-user-search-app",
            "live": "https://bekachaduneli.github.io/github-user-search-app/",
            "about": [
                "Introducing a GitHub user search application created with HTML, CSS, and JavaScript. This project allows users to search for GitHub users and retrieve information about them. Leveraging the power of the GitHub API, users can easily discover and explore the profiles of fellow developers",
                "The project serves as an introduction to working with APIs, providing an opportunity to retrieve data dynamically and showcase it within the application. Discover the world of GitHub and connect with developers around the globe through this user-friendly search application",
                "Experience the thrill of exploring profiles, discovering projects, and gaining insights into the developer community. Join us on this coding journey as we delve into the possibilities of HTML, CSS, and JavaScript, empowering users to search and connect with the GitHub community effortlessly"
            ]
        },
        {
            "name": "Tic Tac Toe",
            "best": false,
            "slug": "A gaming site for playing tic tac toe both in two players and against the computer",
            "id": "tic-tac-toe",
            "videoLink": "tic-tac-toe",
            "frameworks": ["html", "css", "javascript"],
            "date": " Feb",
            "image": [
                "tic-tac-toe-main.png",
                "tic-tac-toe-game.png",
                "tic-tac-toe-win.png"
            ],
            "tools": ["/javascript.png", "/css.png", "/html.png"],
            "github": "https://github.com/bekaChaduneli/tic-tac-toe",
            "live": "https://bekachaduneli.github.io/tic-tac-toe/",
            "about": [
                "Introducing a classic Tic Tac Toe game created with HTML, CSS, and JavaScript. This project allows users to engage in a fun and interactive game of Tic Tac Toe. Users can play against each other in a two-player mode or challenge the computer in a single-player mode",
                "Experience the thrill of strategizing and outsmarting your opponent in this timeless game. As one of the first projects created with JavaScript, the Tic Tac Toe game serves as an introduction to programming logic and user interaction",
                "Engage in friendly competitions, test your skills, and enjoy the nostalgia of this popular game. Join us on this journey as we explore the possibilities of HTML, CSS, and JavaScript, and immerse ourselves in the world of Tic Tac Toe"
            ]
        },
        {
            "name": "Tip calculator app React",
            "best": false,
            "slug": "Tip and amount calculation site that was built with react",
            "id": "tip-calculator-app-react",
            "videoLink": "tip-calculator-react",
            "date": " Mar",
            "image": ["tip-calculator-react.png"],
            "frameworks": ["react", "tailwind"],
            "tools": ["/react.png", "/tailwind.png"],
            "github": "https://github.com/bekaChaduneli/tip-calculator-app-REACT",
            "live": "https://tip-calculator-app-react.web.app/",
            "about": [
                "Introducing a handy Tip Calculator application created with React and Tailwind CSS. This project simplifies the process of calculating tips and total amounts, making it easier for users to manage payments",
                "With a clean and intuitive interface, users can enter the bill amount, select the desired tip percentage, and instantly see the calculated tip amount and total bill",
                "This practical tool eliminates the need for manual calculations and ensures accurate tip calculations every time. Designed with simplicity in mind, the Tip Calculator focuses on functionality and usability, providing users with a convenient solution for calculating tips on the go",
                "Enhance your payment experience and make tipping hassle-free with this React and Tailwind-powered Tip Calculator application"
            ]
        },
        {
            "name": "Todo app",
            "best": false,
            "slug": "A site for managing todos where it is possible to delete, activate and filter todos",
            "id": "todo-app",
            "videoLink": "todo-app",
            "date": " Feb",
            "frameworks": ["html", "css", "javascript"],
            "image": [
                "todo-light.png",
                "todo-dark.png",
                "todo-active.png",
                "todo-completed.png"
            ],
            "tools": ["/javascript.png", "/css.png", "/html.png"],
            "github": "https://github.com/bekaChaduneli/todo-app",
            "live": "https://bekachaduneli.github.io/todo-app/",
            "about": [
                "Introducing a functional Todo App created with HTML, CSS, and JavaScript. This project provides users with a simple and intuitive interface to manage their tasks efficiently. Users can easily add new todos, mark them as completed or active, and delete them as needed",
                "The app also includes a feature that highlights the active todos, allowing users to prioritize their tasks effectively. Additionally, users have the option to switch to a dark mode theme for a more comfortable viewing experience",
                "The Todo App focuses on usability and practicality, offering a straightforward solution for organizing and tracking daily tasks",
                "With its user-friendly design and essential features, this HTML, CSS, and JavaScript-based Todo App simplifies task management and enhances productivity"
            ]
        },
        {
            "name": "Tip calculator app",
            "best": false,
            "slug": "Tip and amount calculation site that was built with javascript",
            "id": "tip-calculator-app",
            "videoLink": "tip-calculator",
            "date": " Jan",
            "image": ["tip-calculator.png"],
            "frameworks": ["html", "css", "javascript"],
            "tools": ["/javascript.png", "/css.png", "/html.png"],
            "github": "https://github.com/bekaChaduneli/tip-calculator-app",
            "live": "https://bekachaduneli.github.io/tip-calculator-app/",
            "about": [
                "Introducing a Tip Calculator application built using HTML, CSS, and JavaScript. This project allows users to calculate the tip amount and total bill based on the entered bill amount and desired tip percentage",
                "By providing a convenient and efficient way to calculate tips, this application aims to simplify the payment process for users. With its straightforward interface, users can easily input the bill amount and select the desired tip percentage to instantly obtain the tip amount and the final total",
                "This project serves as an excellent introduction to JavaScript programming, providing a practical example of using basic mathematical calculations to enhance user experience",
                "Overall, the Tip Calculator application offers a practical solution for quickly calculating tips, making it a useful tool for everyday use"
            ]
        },
        {
            "name": "Interactive rating component",
            "best": false,
            "slug": "A site where you can rate anything from 1 to 5 points",
            "id": "interactive-rating-component",
            "videoLink": "rating-component",
            "date": " Feb",
            "image": ["rating-main.png", "rating-submit.png"],
            "frameworks": ["react", "tailwind"],
            "tools": ["/react.png", "/tailwind.png"],
            "github": "https://github.com/bekaChaduneli/interactive-rating-component",
            "live": "https://interactive-rating-component-amber-two.vercel.app/",
            "about": [
                "Introducing a Rating Component built with React and Tailwind CSS. This project allows users to provide their rating for an app or any other item. Users can select their preferred score and submit their vote",
                "The Rating Component provides a simple and intuitive interface for users to express their opinion. As a first React project, it serves as a great introduction to the fundamental concepts of React, such as component-based architecture and state management",
                "By utilizing Tailwind CSS, the project achieves a clean and modern design. The Rating Component is a valuable addition to any website or application that requires user feedback and ratings",
                "With its user-friendly interface and easy integration, it provides a convenient solution for collecting and displaying user ratings"
            ]
        },
        {
            "name": "Sass project",
            "best": false,
            "slug": "A site with a simple design, for which I used Sass for the first time",
            "id": "sass-project",
            "videoLink": "equlizer-landing-page",
            "date": " Feb",
            "image": ["equalizer.png"],
            "frameworks": ["html", "scss"],
            "tools": ["/javascript.png", "/css.png", "/html.png"],
            "github": "https://github.com/bekaChaduneli/scss-project",
            "live": "https://bekachaduneli.github.io/Sass-project/",
            "about": [
                "Introducing a project created with HTML and Sass. This project serves as an opportunity for me to explore and expand my knowledge of Sass, a powerful CSS preprocessor. The main objective of this project is to gain hands-on experience with Sass by building simple designs",
                "By using Sass, I can leverage its features such as variables, mixins, and nesting to write more efficient and maintainable CSS code. The project focuses on practicing and implementing Sass-specific techniques, enabling me to improve my skills in styling and design",
                "While the emphasis is on learning and experimentation rather than complex functionality, the project serves as a solid foundation for future projects and furthering my understanding of Sass"
            ]
        },
        {
            "name": "Todo",
            "best": false,
            "slug": "A site for managing todos where it is possible to delete, activate and filter todos, which are saved in the user sessions",
            "id": "todo",
            "videoLink": "todo",
            "date": " jun",
            "image": ["todo.png"],
            "frameworks": ["react", "css"],
            "tools": ["/react.png", "/css.png"],
            "github": "https://github.com/bekaChaduneli/artmedia-todo-test",
            "live": "https://todo-mocha-rho.vercel.app/",
            "about": [
                "Introducing a functional Todo created with React and Css. This project provides users with a simple and intuitive interface to manage their tasks efficiently. Users can easily add new todos, mark them as completed or active, and delete them as needed",
                "The app also includes a feature that highlights the active todos, allowing users to prioritize their tasks effectively. Additionally, users have the option to switch to a dark mode theme for a more comfortable viewing experience",
                "This todo can save your tasks within your session. This means that your task information is securely stored and easily accessible whenever you use the app",
                "With its user-friendly design and essential features, this React and Css based Todo App simplifies task management and enhances productivity"
            ]
        },
        {
            "name": "Posts List",
            "best": false,
            "slug": "seamless platform to explore and engage with a wide range of posts",
            "id": "posts",
            "videoLink": "posts-list",
            "date": " jun",
            "image": ["posts.png", "post.png"],
            "frameworks": ["react", "css"],
            "tools": ["/react.png", "/css.png"],
            "github": "https://github.com/bekaChaduneli/artmedia-proj",
            "live": "https://artmedia-proj-q3a6.vercel.app/",
            "about": [
                "Posts List is built with Next.js and CSS, is a remarkable project that brings you a seamless platform to explore and engage with a wide range of posts. With a simple and intuitive interface, users can dive into a captivating world of posts, authors, and comments, all powered by an API",
                "Experience the joy of browsing through a diverse collection of posts, effortlessly loading and displaying content. Posts List allows you to delve into each post, discover its author, and engage with the vibrant community through comments",
                "Share your thoughts and connect with like-minded individuals by adding comments, fostering meaningful conversations that extend beyond the initial post. With each visit, explore the author's other posts, gaining a deeper understanding of their unique perspectives",
                "Posts List opens the gateway to endless possibilities, where exploration, connection, and engagement seamlessly intertwine. Embrace the world of posts, authors, and comments with PostConnect and discover a truly enriching experience"
            ]
        },
        {
            "name": "Tip calculator app",
            "best": false,
            "slug": "Tip and amount calculation site that was built with javascript",
            "id": "tip-calculator-app",
            "videoLink": "tip-calculator",
            "date": " Jan",
            "image": ["tip-calculator.png"],
            "frameworks": ["html", "css", "javascript"],
            "tools": ["/javascript.png", "/css.png", "/html.png"],
            "github": "https://github.com/bekaChaduneli/tip-calculator-app",
            "live": "https://bekachaduneli.github.io/tip-calculator-app/",
            "about": [
                "Introducing a Tip Calculator application built using HTML, CSS, and JavaScript. This project allows users to calculate the tip amount and total bill based on the entered bill amount and desired tip percentage",
                "By providing a convenient and efficient way to calculate tips, this application aims to simplify the payment process for users. With its straightforward interface, users can easily input the bill amount and select the desired tip percentage to instantly obtain the tip amount and the final total",
                "This project serves as an excellent introduction to JavaScript programming, providing a practical example of using basic mathematical calculations to enhance user experience",
                "Overall, the Tip Calculator application offers a practical solution for quickly calculating tips, making it a useful tool for everyday use"
            ]
        },
        {
            "name": "launch countdown timer",
            "best": false,
            "slug": "A countdown timer site where the user can see how much time is left until the countdown ends",
            "id": "launch-countdown-timer",
            "videoLink": "launch-countdown",
            "date": " Feb",
            "image": ["launch-countdown.png"],
            "frameworks": ["html", "css", "javascript"],
            "tools": ["/javascript.png", "/css.png", "/html.png"],
            "github": "https://github.com/bekaChaduneli/launch-countdown-timer",
            "live": "https://bekachaduneli.github.io/launch-countdown-timer/",
            "about": [
                "Presenting a project developed using HTML, CSS, and JavaScript – a countdown timer app. The primary purpose of this project is to create a user-friendly application where users can set specific countdown durations and visualize the remaining time",
                "By inputting the desired time, users can initiate the countdown, and the app will display the decreasing time in a clear and intuitive manner",
                "This project serves as an opportunity for me to practice JavaScript functionality and manipulate the DOM dynamically. It focuses on implementing essential timer features and providing a smooth user experience",
                "Through this project, I aimed to enhance my JavaScript skills and gain a better understanding of handling time-related operations within a web application"
            ]
        },
        {
            "name": "Single page design portfolio",
            "best": false,
            "slug": "Website with portfolio design, with slide pagination",
            "id": "single-page-design-portfolio",
            "videoLink": "single-page-portfolio",
            "date": " Feb",
            "image": ["single-page-portfolio.png"],
            "frameworks": ["html", "css", "javascript"],
            "tools": ["/javascript.png", "/css.png", "/html.png"],
            "github": "https://github.com/bekaChaduneli/single-page-design-portfolio",
            "live": "https://bekachaduneli.github.io/single-page-design-portfolio/",
            "about": [
                "Introducing a project developed using HTML, CSS, and JavaScript – a single-page design website. The objective of this project was to create a visually appealing website that showcases information about a particular individual",
                "One of the main highlights of this project is the implementation of a slider using native JavaScript, providing a seamless navigation experience for users to view different sections of the website",
                "By utilizing HTML and CSS, I aimed to enhance my skills in creating structured and visually appealing web pages. The focus was on designing an engaging layout and incorporating smooth transitions using JavaScript",
                "This project served as an opportunity to expand my knowledge in front-end development and explore different techniques to create an interactive and well-designed website"
            ]
        },
        {
            "name": "Faq accordion card",
            "best": false,
            "slug": "A component with an accordion effect",
            "id": "faq-accordion-card",
            "videoLink": "faq-accordion-card",
            "date": " Jan",
            "frameworks": ["html", "css", "javascript"],
            "image": ["faq-accordion.png"],
            "tools": ["/javascript.png", "/css.png", "/html.png"],
            "github": "https://github.com/bekaChaduneli/faq-accordion-card",
            "live": "https://bekachaduneli.github.io/faq-accordion-card/",
            "about": [
                "Introducing a project developed using HTML, CSS, and JavaScript – an FAQ Accordion Card. This project focuses on creating an interactive component where users can access information in an accordion-style format",
                "It served as my first attempt at implementing an accordion feature using JavaScript. The purpose was to provide a user-friendly experience by allowing users to expand and collapse sections to view relevant information",
                "The HTML and CSS were utilized to structure and style the accordion card, while JavaScript was responsible for the functionality of expanding and collapsing the sections",
                "Through this project, I aimed to enhance my skills in front-end development and gain experience in creating interactive components that improve the usability of web pages"
            ]
        },
        {
            "name": "Interactive pricing component",
            "best": false,
            "slug": "Input type, price determining component",
            "id": "interactive-pricing-component",
            "videoLink": "pricing-component",
            "date": " Jan",
            "image": ["interactive-pricing-component.png"],
            "frameworks": ["html", "css", "javascript"],
            "tools": ["/css.png", "/html.png"],
            "github": "https://github.com/bekaChaduneli/interactive-pricing-component",
            "live": "https://bekachaduneli.github.io/interactive-pricing-component/",
            "about": [
                "Introducing an interactive pricing component project developed using HTML, CSS, and JavaScript. This project focuses on creating a pricing display where users can easily compare and select different pricing options",
                "The main challenge was to design and implement the styles for the pricing component, ensuring it was visually appealing and user-friendly. The JavaScript functionality allows users to see which features and prices are associated with each plan, enabling them to make informed decisions",
                "Through this project, I aimed to enhance my skills in front-end development and gain experience in creating interactive and visually engaging components",
                "The HTML structure and CSS styles were utilized to create the layout and aesthetics of the pricing component, while JavaScript was responsible for the dynamic display of information"
            ]
        },
        {
            "name": "Fylo landing page",
            "best": false,
            "slug": "A design-built project with a file storage site with mail validation",
            "id": "fylo-landing-page",
            "videoLink": "fylo",
            "date": " Jan",
            "frameworks": ["html", "css"],
            "image": ["fylo-landing-page.png"],
            "tools": ["/css.png", "/html.png"],
            "github": "https://github.com/bekaChaduneli/fylo-landing-page-with-two-column-layout-master",
            "live": "https://bekachaduneli.github.io/fylo-landing-page-with-two-column-layout-master/",
            "about": [
                "Introducing the Fylo Landing Page project, developed using HTML and CSS. This project represents my most recent endeavor where I focused on creating a visually appealing landing page for Fylo, a fictional company",
                "The project primarily utilizes HTML and CSS to structure and style the page, showcasing my skills in front-end development. Additionally, a small JavaScript snippet was implemented for email validation purposes, ensuring that user-submitted email addresses are valid",
                "The landing page aims to effectively communicate Fylo's key features and offerings through concise and engaging content sections. The design emphasizes a clean and modern aesthetic, with attention to detail in layout and typography",
                "By completing this project, I furthered my proficiency in HTML and CSS while gaining experience in incorporating basic JavaScript functionality for form validation"
            ]
        },
        {
            "name": "Typemaster landing page",
            "best": false,
            "slug": "typemaster website which is styled with grid layout",
            "id": "typemaster-landing-page",
            "videoLink": "typemaster",
            "date": " Jan",
            "frameworks": ["html", "css"],
            "image": ["typemaster.png"],
            "tools": ["/css.png", "/html.png"],
            "github": "https://github.com/bekaChaduneli/typemaster-pre-launch-landing-page",
            "live": "https://bekachaduneli.github.io/typemaster-pre-launch-landing-page/",
            "about": [
                "Presenting a project created using HTML and CSS that heavily utilizes grid for styling purposes. The primary objective of this project was to implement a grid-based layout, which proved to be quite challenging due to the complexity of creating visually appealing and well-structured styles",
                "Through persistent effort and attention to detail, I successfully crafted an aesthetically pleasing design using the grid system. This project provided valuable experience in working with grid layouts and improved my ability to create effective styles",
                "By overcoming the difficulties encountered during the development process, I acquired a deeper understanding of HTML and CSS, enhancing my skill set for future projects"
            ]
        },
        {
            "name": "Dynamic Form",
            "best": false,
            "slug": "Generated form where it is possible to receive unlimited information from the user",
            "id": "dynamic-form",
            "videoLink": "dynamic-form",
            "date": " May",
            "frameworks": ["react", "css"],
            "image": ["dynamic-form.png"],
            "tools": ["/react.png", "/css.png"],
            "github": "https://github.com/bekaChaduneli/dynamic-form",
            "live": "https://dynamic-form-ruddy.vercel.app/",
            "about": [
                "Dynamic form is built using React and CSS, this tool enables users to create forms with ease, adding inputs and components as needed",
                "In form users can effortlessly write and manage inputs within their forms. The flexibility of this project allows users to add new elements on the go, adapting the form to their specific requirements",
                "When it's time to submit, form conveniently bundles all the entered information into a single, organized array. This simplifies the process of data collection, eliminating the need to manage multiple inputs individually"
            ]
        },
        {
            "name": "four card section",
            "best": false,
            "slug": "A flexible project of four components whose positions are selected by a grid",
            "id": "four-card-section",
            "frameworks": ["html", "css"],
            "date": " Jan",
            "image": ["four-card.png"],
            "tools": ["/css.png", "/html.png"],
            "github": "https://github.com/bekaChaduneli/four-card-feature-section-master",
            "live": "https://bekachaduneli.github.io/four-card-feature-section-master/",
            "about": [
                "Introducing a project created with HTML and CSS featuring four cards that are arranged using the grid system. This project served as my initial introduction to working with grids. It provided an opportunity to explore and familiarize myself with the grid layout and its functionalities",
                "Implementing the grid for organizing the cards proved to be an insightful experience, allowing me to understand the grid's flexibility and its potential for creating responsive designs",
                "By diligently experimenting with the grid properties and configurations, I successfully achieved the desired card arrangement. This project marked an important milestone in my journey, enabling me to grasp the fundamental concepts of grid-based layouts and laying a strong foundation for future projects"
            ]
        },
        {
            "name": "Art gallery website",
            "best": false,
            "slug": "A site with a gallery design consisting of 2 pages, the main page and the location",
            "id": "art-gallery-website",
            "videoLink": "art-portfolio",
            "date": " Jan",
            "frameworks": ["html", "css"],
            "image": ["art-gallery-main.png", "art-gallery-about.png"],
            "tools": ["/css.png", "/html.png"],
            "github": "https://github.com/bekaChaduneli/art-gallery-website",
            "live": "https://bekachaduneli.github.io/art-gallery-website/",
            "about": [
                "Introducing ArtGallery, a project created with HTML and CSS consisting of two pages. The first page showcases an art gallery, while the second page provides information about its location. This project marks a significant milestone as it was my first experience connecting pages using the <a> tag",
                "Implementing this feature allowed for seamless navigation between the art gallery page and the location page, enhancing the overall user experience",
                "Through this project, I gained valuable insights into the concept of linking pages and gained a deeper understanding of how to create interconnected web experiences. ArtGallery serves as a testament to my growth and proficiency in HTML and CSS, demonstrating my ability to create multi-page websites with smooth transitions and cohesive navigation"
            ]
        },
        {
            "name": "Equalizer landing page",
            "best": false,
            "slug": "html css website with audio systems design",
            "id": "equalizer-landing-page",
            "videoLink": "equlizer-landing-page",
            "frameworks": ["html", "css"],
            "date": " Jan",
            "image": ["/equalizer.png"],
            "tools": ["/css.png", "/html.png"],
            "github": "https://github.com/bekaChaduneli/equalizer-landing-page",
            "live": "https://bekachaduneli.github.io/equalizer-landing-page/",
            "about": [
                "Introducing the Equalizer Landing Page, a visually stunning project created with HTML and CSS. The main focus of this project was to design an eye-catching layout featuring multiple boxes within a container, with some of the boxes partially extending outside the container",
                "This unique design challenge pushed the boundaries of my HTML and CSS skills and allowed me to explore creative techniques to achieve the desired effect",
                "The Equalizer Landing Page stands as a testament to my ability to create visually appealing and dynamic web designs, showcasing my proficiency in crafting engaging user interfaces",
                "Through this project, I honed my skills in layout design, positioning elements, and creating visually captivating compositions. The Equalizer Landing Page captures attention and offers a memorable user experience with its captivating design"
            ]
        },
        {
            "name": "Skilled landing page",
            "best": false,
            "slug": "My first website which is also responsive",
            "id": "skilled-landing-page",
            "videoLink": "skilled-landing-page",
            "date": " Jan",
            "image": ["/skilled-landing-page.png"],
            "frameworks": ["html", "css"],
            "tools": ["/css.png", "/html.png"],
            "github": "https://github.com/bekaChaduneli/skilled-elearning-landing-page",
            "live": "https://encouraging-catnip-washer.glitch.me/",
            "about": [
                "Introducing the Skilled Landing Page, a project crafted with HTML and CSS. As my first endeavor in creating a complete web page rather than individual components, the Skilled Landing Page showcases my ability to design and develop a responsive layout",
                "The primary objective of this project was to ensure that the page adapts seamlessly to different screen sizes and devices, providing an optimal viewing experience for users across desktops, tablets, and mobile devices",
                "By incorporating responsive design principles, I learned how to structure and style elements to achieve fluidity and responsiveness. The Skilled Landing Page serves as a testament to my growing skills in creating engaging and user-friendly web pages",
                "It exemplifies my commitment to staying up-to-date with modern web design practices and delivering a seamless user experience"
            ]
        },
        {
            "name": "ShpagattiBall",
            "best": false,
            "slug": "CodeHS (Introducing to javascript) final project where I created a football game with two characters: Jotia Tsaava and Harry Maguire",
            "id": "shpagattiBall",
            "date": " Dec",
            "frameworks": ["codehs"],
            "tools": ["/codehs.png"],
            "image": ["codehs-project.png"],
            "live": "https://codehs.com/share/id/write-the-code-gLvrFR/run",
            "about": [
                "Mini game developed through the CodeHS Karel course. In this project, immerse yourself in the world of football as Jotia Tsaava and Harry Maguaire. The game continues until one player scores 3 goals",
                "ShpagattiBall is the final task of my learning journey in the CodeHS Karel course, where I acquired my programming skills and grasped the fundamentals."
            ]
        }
    ],

    "skills": [
        {
            "name": "React",
            "main": true,
            "startlearningdate": "February",
            "icon": "/react.png",
            "tip": "Javascript framework",
            "projectsList": [
                "entertaiment-app",
                "planet-facts",
                "my-portfolio",
                "clock-app",
                "3d-portfolio",
                "metaversus-app",
                "clock-app",
                "interactive-card-details",
                "todo-ui",
                "github-user-search-react",
                "company-project",
                "tip-calculator-app-react",
                "interactive-rating-component"
            ],
            "about": ""
        },
        {
            "name": "nextjs",
            "main": true,
            "startlearningdate": "April",
            "tip": "Javascript framework",
            "icon": "/next.png",
            "projectsList": [
                "breadit",
                "spotify-clone",
                "google-clone",
                "imdb-clone"
            ],
            "about": ""
        },
        {
            "name": "Typescript",
            "main": true,
            "startlearningdate": "March",
            "icon": "/typescript.png",
            "tip": "Javascript superset",
            "projectsList": [
                "breadit",
                "spotify-clone",
                "entertaiment-app",
                "my-portfolio",
                "planet-facts",
                "3d-portfolio",
                "clock-app",
                "interactive-card-details"
            ],
            "about": ""
        },
        {
            "name": "NodeJS",
            "main": false,
            "icon": "/node.png",
            "startlearningdate": "February",
            "tip": "Javascript backend framework",
            "projectsList": [],
            "about": ""
        },
        {
            "name": "ThreeJS",
            "main": true,
            "icon": "/three.png",
            "startlearningdate": "March",
            "tip": "JavaScript framework",
            "projectsList": ["my-portfolio", "3d-portfolio"],
            "about": ""
        },
        {
            "name": "Javascript",
            "main": true,
            "startlearningdate": "January",
            "icon": "/javascript.png",
            "tip": "Programming language",
            "projectsList": [
                "weddings-project",
                "ecommerce-product",
                "interactive-comment-section",
                "todo-app",
                "tic-tac-toe",
                "launch-countdown-timer",
                "github-user-search",
                "single-page-design-portfolio",
                "interactive-pricing-component",
                "tip-calculator"
            ],
            "about": ""
        },
        {
            "name": "MySql",
            "startlearningdate": "February",
            "main": true,
            "tip": "Database",
            "icon": "/mysql.png",
            "projectsList": ["breadit", "spotify-clone"],
            "about": ""
        },
        {
            "name": "Postgres",
            "startlearningdate": "February",
            "main": true,
            "tip": "Database",
            "icon": "/postgres.png",
            "projectsList": ["breadit", "spotify-clone"],
            "about": ""
        },
        {
            "name": "Styled Components",
            "main": false,
            "icon": "/styledcomponents.png",
            "startlearningdate": "March",
            "tip": "Css Framework",
            "projectsList": [
                "planet-facts",
                "github-user-search-react",
                "entertaiment-web-app",
                "3d-portfolio"
            ],
            "about": ""
        },
        {
            "name": "Chakra UI",
            "main": false,
            "icon": "/chakraui.png",
            "startlearningdate": "March",
            "tip": "Css Framework",
            "projectsList": [
                "my-portfolio",
                "clock-app",
                "interactive-card-details"
            ],
            "about": ""
        },
        {
            "name": "Green Sock",
            "main": false,
            "icon": "/gsap.png",
            "startlearningdate": "April",
            "tip": "Animation Framework",
            "projectsList": ["weddings-project"],
            "about": ""
        },
        {
            "name": "Prisma",
            "main": false,
            "icon": "/prisma.png",
            "startlearningdate": "jun",
            "tip": "next-generation ORM",
            "projectsList": ["breadit"],
            "about": ""
        },
        {
            "name": "Supabase",
            "main": false,
            "icon": "/supabase.png",
            "startlearningdate": "jun",
            "tip": "open source Firebase alternative",
            "projectsList": ["spotify-clone"],
            "about": ""
        },
        {
            "name": "Taiwlind",
            "main": false,
            "icon": "/tailwind.png",
            "startlearningdate": "February",
            "tip": "Css Framework",
            "projectsList": [
                "breadit",
                "spotify-clone",
                "google-clone",
                "imdb-clone",
                "metaversus-app",
                "interactive-rating-component",
                "todo-ui",
                "tip-calculator-app-react"
            ],
            "about": ""
        },
        {
            "name": "Jquery",
            "main": false,
            "icon": "/jquery.png",
            "startlearningdate": "April",
            "tip": "JavaScript library",
            "projectsList": ["weddings-project"],
            "about": ""
        },
        {
            "name": "css",
            "startlearningdate": "",
            "main": false,
            "icon": "/css.png",
            "tip": "",
            "projectsList": [
                "ecommerce-product",
                "interactive-comment-section",
                "todo-app",
                "tic-tac-toe",
                "launch-countdown-timer",
                "github-user-search",
                "single-page-design-portfolio",
                "interactive-pricing-component",
                "fylo-landing-page",
                "typemaster-landing-page",
                "four-card-section",
                "art-gallery-website",
                "equalizer-landing-page",
                "skilled-landing-page",
                "tip-calculator"
            ],
            "about": ""
        },
        {
            "name": "html",
            "main": false,
            "icon": "/html.png",
            "startlearningdate": "",
            "tip": "",
            "about": ""
        },
        {
            "name": "Git",
            "main": false,
            "icon": "/git.png",
            "startlearningdate": "January",
            "tip": "version control system",
            "about": ""
        },
        {
            "name": "linux",
            "main": false,
            "startlearningdate": "",
            "tip": "",
            "icon": "/linux.png",
            "about": ""
        },
        {
            "name": "redux",
            "main": false,
            "startlearningdate": "",
            "icon": "/redux.png",
            "tip": "",
            "projectsList": [],
            "about": ""
        },
        {
            "name": "scss",
            "main": false,
            "startlearningdate": "",
            "tip": "",
            "icon": "/scss.png",
            "projectsList": ["weddings-project", "sass-project"],
            "about": ""
        },
        {
            "name": "express",
            "main": false,
            "startlearningdate": "",
            "tip": "nodejs framework",
            "icon": "/express.png",
            "projectsList": [],
            "about": ""
        },
        {
            "name": "figma",
            "main": false,
            "startlearningdate": "",
            "icon": "/figma.png",
            "tip": "",
            "about": ""
        },
        {
            "name": "Jira",
            "main": false,
            "startlearningdate": "",
            "icon": "/jira.png",
            "tip": "",
            "about": ""
        },
        {
            "name": "Trello",
            "main": false,
            "startlearningdate": "",
            "icon": "/trello.png",
            "tip": "",
            "about": ""
        },
        {
            "name": "Postman",
            "main": false,
            "startlearningdate": "February",
            "icon": "/postman.png",
            "tip": "API platform",
            "projectsList": [],
            "about": ""
        }
    ]
}
